Tekla Open API Reference for Tekla Structures 2025
IDoubleDataType Properties
The IDoubleDataType type exposes the following members.
Properties
Name | Description
Value
 The double value of the field.
Top
See Also
Reference
IDoubleDataType Interface
Tekla.Structures.Datatype Namespace